/**
 * =======================================
 * 剧情支线：组织的艺术
 * 
 * 【角色】
 * 三位老师
 * 水谷 虎：言行偏强势，恩威并施
 * 佐佐木 美智子：圆滑的太极高手
 * 伊东 阳一：最初想搞一番大政绩，失败后成为糊弄大师
 * 小泽 圭子：在故事最初就被调走，大约是酱油角色
 * 
 * 【剧情线索】
 * 明线：
 * 		早期校方抗疫的各种智障操作
 * 暗线：
 * 		作为玩家参谋的室友，最初总在心里帮着学校谋划江山，并建议玩家各种向领导反馈，
 * 		最后变成了教玩家各种甩锅的老国企人
 * 
 * 
 * 【day1-3】巡逻计划patrol
 * 4.5
 * 层长剧情
 * 		书记来视察，觉得有同学在寝室楼道里随意走动不安全，
 * 		立刻命所有楼层派志愿者出去坐在楼道里，监督其余人不要走动
 *		 玩家被选中作为志愿者
 * 		玩家有以下几个选择：
 * 		（1）对着摄像头竖中指->护校-1，精神+1
 * 		（2）按老师的做->无事发生
 * 		书记以“防止同学在楼道内聚集”为由，
 * 		要求层长立刻安排志愿者在楼道里坐着“提醒同学不要走动”，
 * 		说“领导会看监控检查”，早7：30-晚11：30期间每两小时轮一班。
 * 		我在的楼层一共38个人，等于每天反而多了9个人在外面接触。
 * 		学生认为这个措施极不合理，那么，需要抵制这个政策吗？
 * 		玩家有以下几个选择：
 * 		（1）尝试跟老师理论->理论失败，精神-1；
 * 		（2）在工作群里直接拒绝执行志愿者活动->被老师训斥，精神-1，关怀+1
 * 		（3）进行登记，但并不去楼道干活->平安度过
 * 		（4）按老师说的做->饱食-1，精神-1
 * 		翌日，有的楼层出了志愿者，有的没有
 * 		再过一日，该计划无疾而终
 * 
 * 
 * 【day3】卷！antigen
 * （第一个7+7的后七天）开始，本楼每人每天要做两次抗原，
 * 其中早上的要求八点半前提交，不然就有志愿者喊话敲门。
 * 问了其他楼的同学，有九点半、十点半提交的，遂电话询问佐佐木老师。
 * 答曰我们楼进了后七天已经是非封控状态，学校要求早交；
 * 我问的其他两个楼是刚出了阳，是封控状态，可以晚交。
 * 并说可以出示学校要求的文件。4.22我们楼出了新的阳之后，
 * 进了封控状态，依旧是八点半交。至今没看到他说的学校文件。
 * 
 * 
 * 【day3-5】层长破防strike
 * 4.9
 * 楼栋里通报了阳性病例，但学生发现，
 * 该同学两天之前就核酸异常了，而楼层负责老师并未告知学生
 * 学生是从其他楼栋学生的口中才了解到阳性病例的存在
 * 层长角色剧情：
 * 		而且，这两日的楼层志愿者们都还在不知情的情况下工作
 * 		并穿着连基本防护都不到位的防护服，学生们非常生气
 * 		话说另一头，小泽走后，新来的伊东凭借着之前管理其他楼宇的政绩
 * 		想在玩家的楼栋复制一下成功经验，
 * 		于是在没有与其他老师沟通的情况下，
 * 		伊东当晚直接召集学生层长开会，布置了全新任务的安排：
 * 		要求各个层长不再选派楼层志愿者
 * 		让层长本人完成从早到晚所有的物资、盒饭配送工作。
 * 		玩家有以下几个选择：
 * 		（1）不搭理老师的要求，继续选派志愿者
 * 		（2）按老师说的做->健康-1，精神-1
 * 第二天，
 * 层长角色的玩家：
 *		某层楼的层长直接bg，负责老师只得自己去送盒饭，送了个全楼最慢
 * 非层长角色的玩家：
 *		不知为何，今天的盒饭送的特别晚->健康-1，精神-1
 * 第三天，层长一人负责全部事务的政策无疾而终。
 * 
 * 
 * 【day5】直播狂欢live
 * 4.22晚上，7+7封控的最后一天，我们楼同学从其他宿舍楼的同学那里得知我们又有了个阳性。
 * 晚上校领导给同学开会正式通知出阳，介绍防疫状况和条件时，
 * 念的是其他校区的稿子（例如我们校区不是公共浴室，而他一直在讲公共浴室）。
 * 学生开始刷屏玩梗，但领导对直播间同学意见依旧当没看见，
 * 末了加一句“传播不实消息将严肃处理”后闭会。
 * 玩家有以下几个选择：
 * （1）参与刷屏吐槽->精神+1
 * （2）什么都不做
 * 层长角色剧情：
 * 		同一天晚上，驻楼老师给层长开会。这一次阳性也是两天前发烧，
 * 		一天前确诊，学校揣了两天才报，导致4.20-4.22的志愿者又不知情干了两天高危工作。
 * 		出阳性的楼层层长质问老师为什么不提前通知，别的楼都知道我们自己楼反而不知道。
 * 		水谷说了一番“出现情况的第一个‘手势’”之类的解释，没敢正面回应。
 * 		精神-1
 * 
 * 
 * 【day6】语言艺术speech
 * 4.26日，学生得知各楼宇物资订购限额有差异，
 * 层长角色剧情：
 * 		水谷老师解释了一下猪肉事件
 * 		学生遂在会议上提出建议:公示每栋楼的物资实发情况。
 * 		玩家在此被选作提意见学生，
 * 		面对玩家的质问，伊东使出“答非所问-装糊涂-记下来”的基层官员三板斧。
 * 		玩家在上述任意阶段都有以下几个选择：
 * 		（1）持续追问到“记下来”时->解锁讨论剧情，得出基层老师作为传话筒的尴尬地位->精神+1，解锁画廊“三板斧”
 * 		（2）放弃追问->直接失望退出会议，精神-1
 * 
 * 
 * 【day7】表彰活动
 * 猪肉事件刚过，楼栋里就决定召开志愿者表彰大会
 * 你也得知本楼宇的抗疫事迹已经被做成公众号文章广为宣发
 * 玩家在此有几种效果触发：
 * （1）若是层长：得到表彰，获得物资+2
 * （2）若是层长且护校>=5：得到表彰，获得物资+2，精神+1
 * （3）若护校<=1且非层长：玩家对此表示谴责，精神-1
 * 会中，佐佐木老师问大家要不要组织楼宇才艺表演，宣传抗疫事迹
 * 玩家在此有如下选择：
 * （1）高兴参与：护校>=5可选择，精神+1
 * （2）不参与：若护校<=1可解锁吐槽语句
 * 
 *
 * 如何整合进主线剧情：
 * （1）在主线剧情中使用命令：jump bureau
 * （2）在本文件的bureau-ending中设定支线结束后的回传位置
 * 
 * 注意事项：
 * 由于还不太清楚monogatari的命名空间问题，
 * 建议本文件内所有剧情block的名字都带上bureau-前缀
 * =======================================
 **/


// Define the Characters
monogatari.characters ({
	'lz': {
		name: '楼长',
		color: 'rgb(0, 168, 138)',
	},
	'cza': {
		name: '层长A',
		color: 'rgb(0, 168, 138)',
	},
	'czb': {
		name: '层长B',
		color: 'rgb(0, 168, 138)',
	},
	'cz': {
		name: '层长',
		color: 'rgb(0, 168, 138)',
	},
	'mi': {
		name: '水谷 虎（楼栋老师）',
		color: '#AA7DFF',
		directory:'mizutani',
		sprites:{
			serious:'serious.png',
			angry:'angry.png',
			happy:'happy.png',
		}
	},
	'sa': {
		name: '佐佐木 美智子（楼栋老师）',
		color: '#FF75FE',
		directory:'sasaki',
		sprites:{
			normal:'normal.png',
			angry:'angry.png',
			noticed:'noticed.png',
			happy:'happy.png',
			wrong:'wrong.png',
		}
	},
	'it': {
		name: '伊东 阳一（楼栋老师）',
		color: '#FF75FE',
		directory:'ito',
		sprites:{
			normal:'normal.png',
			dontcare:'dontcare.png',
			confused:'confused.png',
			happy:'happy.png',
		}
	},

});

monogatari.script ({
	// The game starts here.
	'bureau': [
		'jump patrol'
	],
	'bureau2': [
		'jump patrol2'
	],
	'bureau3': [
		'jump antigen'
	],
	'bureau3-2': [
		'jump patrol3'
	],
	'bureau4': [
		'jump strike'
	],
	'bureau5': [
		'jump antigen2'
	],
	'bureau5-2': [
		'jump strike2'
	],
	'bureau6': [
		'jump strike3'
	],
	'bureau6-2': [
		'jump live'
	],
	'bureau7': [
		'jump speech'
	],
	'bureau8': [
		'jump awarding'
	],
});